Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་ལྷག་པའི་བསམ་པའི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “‌Noble son, a bodhisattva’s buddhafield is a field of high resolve.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་མེ་ཏོག་འདི་དག་སྤྲུགས་ཏེ་ཅི་བྱ།
en: “Reverend Śāriputra, why do you shake these flowers?”

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དགེ་བའི་རྩ་བ་དང་ཚོགས་ཐམས་ཅད་བསགས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who have harvested the two stores and have planted the roots of virtue will be born in his buddhafield.

source: །སྦྱོར་བའི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of virtuous application.

source: །ལྷ་མོས་སྨྲས་པ།
en: The goddess said,

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་སྐད་མ་སྨྲ་ཞིག
en: “Do not say that, reverend Śāriputra.

source: གང་དག་བག་ཆགས་མ་སྤངས་པ་དེ་དག་ལ་ནི་མེ་ཏོག་ཀྱང་འཆགས་ཀྱི། གང་དག་བག་ཆགས་སྤངས་པ་དེ་དག་གི་ལུས་ལ་མེ་ཏོག་མི་ཆགས་ཏེ།
en: Thus, these flowers stick to the bodies of those who have not eliminated their instincts for the passions and do not stick to the bodies of those who have eliminated their instincts.

source: དེ་བས་ན་བག་ཆགས་ཐམས་ཅད་སྤངས་པ་རྣམས་ཀྱི་ལུས་ལ་མེ་ཏོག་མི་ཆགས་སོ།
en: Therefore, the flowers do not stick to the bodies of these bodhisattvas, who have abandoned all instincts.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ལྷ་མོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Śāriputra said to the goddess,

source: །ལྷ་མོ་ཁྱོད་ཁྱིམ་འདིའི་ནང་དུ་ཞུགས་ནས་ཡུན་ཇི་སྲིད་ཅིག་ལོན།
en: “Goddess, how long have you been in this house?”

source: དེ་ནས་གནས་བརྟན་ཅང་མི་ཟེར་བར་གྱུར་ཏོ།
en: At that, the elder Śāriputra fell silent.

source: ད་དུས་ལ་བབ་ན་དྲིས་པའི་ལན་མི་བླན།
en: Now, when it is your turn, you do not answer the question.”

source: །དེ་བཞིན་དུ་ཡི་གེ་དེ་ནང་ནའང་མེད། ཕྱི་རོལ་ནའང་མེད། གཉི་ག་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Likewise, syllables are neither internal nor external, nor can they be apprehended anywhere else.

source: །དེ་ལྟ་བས་ན་བཙུན་པ་ཤཱ་རིའི་བུ་ཡི་གེ་བསལ་བས་རྣམ་པར་གྲོལ་བ་མ་སྟོན་ཅིག
en: Therefore, reverend Śāriputra, do not point to liberation by abandoning speech!

source: གང་དག་མངོན་པའི་ང་རྒྱལ་མེད་པ་དེ་དག་ལ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་རང་བཞིན་ཉིད་རྣམ་པར་གྲོལ་བའོ།
en: But those free of pride are taught that the very nature of desire, hatred, and folly is itself liberation.

source: མངོན་སུམ་དུ་བྱས་པའང་མེད་དེ།
en: I have no realization.

source: དེས་ན་བདག་གི་སྤོབས་པ་འདི་འདྲའོ།
en: Therefore I have such eloquence.

source: །གང་དག་འདི་སྙམ་དུ་བདག་གིས་ཐོབ་ཅིང་མངོན་སུམ་དུ་བྱས་སོ་སྙམ་པ་དེ་དག་ནི་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་ང་རྒྱལ་ཅན་ཞེས་བྱའོ།
en: Whoever thinks, “I have attained! I have realized!” is overly proud in the discipline of the well taught Dharma.

source: །བདག་ནི་རྟེན་འབྲེལ་བཅུ་གཉིས་ཀྱི་སྒོ་ནས་འཇུག་པས་ན་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཅན་ནོ།
en: I belong to the solitary sage vehicle when I teach the twelve links of dependent origination to those who need them.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་གནས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who live by all virtuous principles will be born in his buddhafield.

source: །བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་རྒྱ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is the magnificence of the conception of the spirit of enlightenment.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who are actually participating in the Mahāyāna will be born in his buddhafield.

source: །སྦྱིན་པའི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of generosity.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who give away all their possessions will be born in his buddhafield.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of morality.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བསམ་པ་ཐམས་ཅད་དང་ལྡན་ཞིང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་སྲུང་བའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who follow the path of the ten virtues with positive thoughts will be born in his buddhafield.

source: །བཟོད་པའི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of tolerance.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་ཅིང་བཟོད་པ་དང་། དུལ་བ་དང་ཞི་གནས་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings with the transcendences of tolerance, discipline, and the superior trance—hence beautiful with the thirty-two auspicious signs—will be born in his buddhafield.

source: །བརྩོན་འགྲུས་ཀྱི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of effort.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་བརྩོན་འགྲུས་བརྩམས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who devote their efforts to virtue will be born in his buddhafield.

source: །བསམ་གཏན་གྱི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of meditation.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དྲན་པ་དང་ཤེས་བཞིན་གྱིས་མཉམ་པར་བཞག་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who are evenly balanced through mindfulness and awareness will be born in his buddhafield.

source: །ཤེས་རབ་ཀྱི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is a field of wisdom.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཡང་དག་པ་ཉིད་དུ་ངེས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who are destined for the ultimate will be born in his buddhafield.

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་གསུམ་པའོ།
en: That is the third strange and wonderful thing.

source: །ཚད་མེད་པ་བཞི་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield consists of the four immeasurables.

source: །བསྡུ་བའི་དངོས་པོ་བཞི་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield consists of the four means of unification.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་རྣམ་པར་གྲོལ་བ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་ཟིན་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who are held together by all the liberations will be born in his buddhafield.

source: །ཐབས་ལ་མཁས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is skill in liberative art.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཐབས་དང་དཔྱོད་པ་ཐམས་ཅད་ལ་མཁས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings skilled in all liberative arts and activities will be born in his buddhafield.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཆོས་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield consists of the thirty-seven aids to enlightenment.

source: སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ། ཕྱོགས་བཅུར་སྒྲ་ཤིན་ཏུ་བསྒྲགས་པ།
en: and their great teachings resounded like the lion’s roar throughout the ten directions.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་བློ་གྲོས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Siṃhamati declared,

source: འདི་ནི་ཟག་པ་དང་བཅས་པ། འདི་ནི་ཟག་པ་མེད་པའོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “To say, ‘this is impure’ and ‘that is immaculate’ makes for duality.

source: །ཡོངས་སུ་བསྔོ་བའི་སེམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is his mind of total dedication.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་རྒྱན་རྣམས་སྣང་བར་འགྱུར་རོ།
en: When he attains enlightenment, the ornaments of all virtues will appear in his buddhafield.

source: །མི་ཁོམ་པ་བརྒྱད་རབ་ཏུ་ཞི་བར་བསྟན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is the doctrine that eradicates the eight adversities.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ངན་སོང་ཐམས་ཅད་ཤིན་ཏུ་ཆད་ཅིང་མི་ཁོམ་པ་བརྒྱད་མེད་པར་འགྱུར་རོ།
en: When he attains enlightenment, the three bad migrations will cease, and there will be no such thing as the eight adversities in his buddhafield.

source: གང་མཉམ་པ་ཉིད་ཀྱི་ཆོས་ཐོབ་པས་ཟག་པ་དང་ཟག་པ་མེད་པའི་འདུ་ཤེས་སུ་མི་བྱེད་འདུ་ཤེས་མེད་པར་གྱུར་པའང་མ་ཡིན།
en: One who, attaining equanimity, forms no conception of impurity or immaculateness, yet is not utterly without conception,

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་ཁྱིམ་འདི་ན་རྟག་ཏུ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནས་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་མི་འབྲལ་ཏེ།
en: Furthermore, reverend Śāriputra, this house is never forsaken by Śakra, Brahmā, the Lokapālas, and the bodhisattvas from all the other buddhafields.

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་གཉིས་པའོ།
en: That is the second strange and wonderful thing.

source: །བདག་ཉིད་བསླབ་པའི་གཞི་རྣམས་ལ་གནས་ཤིང་ཕ་རོལ་གྱི་ལྟུང་བ་མི་གླེང་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield consists of his personal observance of the basic precepts and his restraint in blaming others for their transgressions.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་གང་དག་ཁྱིམ་འདིར་ཞུགས་པ་དེ་དག་ཞུགས་མ་ཐག་ཏུ་ཉོན་མོངས་པས་གཙེ་བ་མེད་དེ་
en: Furthermore, reverend Śāriputra, whoever enters this house is no longer troubled by his afflictions from the moment he is within.

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་དང་ལྡན་པ་དང་པོའོ།
en: That is the first wonder of this house.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ལྟུང་བའི་སྒྲ་ཡང་མི་གྲག་པར་འགྱུར་རོ།
en: When he attains enlightenment, even the word ‘crime’ will never be mentioned in his buddhafield.

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་དག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟེ།
en: “A bodhisattva’s buddhafield is the purity of the path of the ten virtues.

source: ཁྱིམ་འདི་ན་གསེར་གྱི་ཁ་དོག་གི་འོད་རྟག་ཏུ་རྒྱུན་མི་འཆད་པས་ན་མཚན་མོའམ། ཉིན་བར་དུ་ཡང་མི་མངོན། ཁྱིམ་འདིར་ཟླ་བ་དང་ཉི་མའང་མི་མངོན་མི་སྣང་སྟེ།
en: A light of golden hue shines here constantly, so bright that it is hard to distinguish day and night, and neither the moon nor the sun shines here distinctly.

source: །བརྒྱད་པོ་གང་ཞེ་ན།
en: What are these eight?

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱིམ་འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམ་པ་བརྒྱད་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སྣང་ངོ་།
en: Reverend Śāriputra, eight strange and wonderful things manifest themselves constantly in this house.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ཁྱིམ་འདི་ན་ལོ་བཅུ་གཉིས་ལོན་ཡང་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོར་ལྡན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་སངས་རྒྱས་ཀྱི་ཆོས་དང་ལྡན་པ་མ་གཏོགས་པར་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་ལྡན་པའི་གཏམ་སྔོན་མ་ཐོས་སོ།
en: Reverend Śāriputra, I have been in this house for twelve years, and I have heard no discourses concerning the disciples and solitary sages but have heard only those concerning the great love, the great compassion, and the inconceivable qualities of the Buddha.

source: གང་ཡེ་ཤེས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་གྲངས་ཐམས་ཅད་དང་བྲལ་ཞིང་བློ་ནམ་མཁའ་དང་མཚུངས་པར་མི་ཆགས་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: One who is free of all calculations, through the extreme purity of gnosis—his mind is aloof, like empty space; and thus he enters into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སྲེད་མེད་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Nārāyaṇa declared,

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་ཅི་འདྲ་བར་བསམ་པ་ཡང་དེ་འདྲའོ།
en: “Thus, noble son, just as is the bodhisattva’s production of the spirit of enlightenment, so is his positive thought.

source: །བསམ་པ་ཅི་འདྲ་བར་སྦྱོར་བ་ཡང་དེ་འདྲའོ།
en: And just as is his positive thought, so is his virtuous application.

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་བཞི་པའོ།
en: That is the fourth strange and wonderful thing.

source: །སྦྱོར་བ་ཇི་སྙེད་པར་ལྷག་པའི་བསམ་པ་ཡང་དེ་སྙེད་དོ།
en: “His virtuous application is tantamount to his high resolve;

source: །ལྷག་པའི་བསམ་པ་ཇི་སྙེད་པར་ངེས་པར་སེམས་པ་ཡང་དེ་སྙེད་དོ།
en: his high resolve is tantamount to his determination;

source: །ངེས་པར་སེམས་པ་ཇི་སྙེད་པར་སྒྲུབ་པ་ཡང་དེ་སྙེད་དོ།
en: his determination is tantamount to his practice;

source: འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་ལྔ་པའོ།
en: That is the fifth strange and wonderful thing.

source: །སྒྲུབ་པ་ཇི་སྙེད་པར་ཡོངས་སུ་བསྔོ་བ་ཡང་དེ་སྙེད་དོ།
en: his practice is tantamount to his total dedication;

source: །ཡོངས་སུ་བསྔོ་བ་ཇི་སྙེད་པར་ཐབས་རྣམས་ཀྱང་དེ་སྙེད་དོ།
en: his total dedication is tantamount to his liberative art;

source: གང་འཇིག་རྟེན་གྱི་རང་བཞིན་སྟོང་པ་དེ་ལ་ཅུང་ཟད་ཀྱང་རྒལ་བ་ཡང་མེད། འཇུག་པ་ཡང་མེད།
en: This world has the nature of voidness, so there is neither transcendence nor involvement,

source: འགྲོ་བའང་མེད། མི་འགྲོ་བའང་མེད་དེ།
en: neither progress nor standstill.

source: །བྱང་ཆུབ་སེམས་དཔའ་དུལ་བའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Dāntamati declared,

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Life’ and ‘liberation’ are dualistic.

source: འཁོར་བའི་ངོ་བོ་ཉིད་མཐོང་བས་མི་འཁོར་ཞིང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ།
en: Having seen the nature of life, one neither belongs to it nor is one utterly liberated from it.

source: གང་དེ་ལྟར་རྟོགས་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Such understanding is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མངོན་སུམ་མཐོང་གིས་སྨྲས་པ།
en: The bodhisattva Pratyakṣadarśa declared,

source: ཟད་པ་དང་མི་ཟད་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་སོ།
en: “ ‘Destructible’ and ‘indestructible’ are dualistic.

source: །ཟད་པ་ནི་ཤིན་ཏུ་ཟད་པ་སྟེ།
en: What is destroyed is ultimately destroyed.

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Thereupon, magically influenced by the Buddha, the venerable Śāriputra had this thought:

source: །བྱང་ཆུབ་སེམས་དཔའ་གློག་གི་ལྷས་སྨྲས་པ།
en: The bodhisattva Vidyuddeva declared,

source: རིག་པ་དང་མ་རིག་པ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ་
en: “ ‘Knowledge’ and ‘ignorance’ are dualistic.

source: གལ་ཏེ་ཇི་ལྟ་བུར་སེམས་ཡོངས་སུ་དག་པ་དེ་འདྲ་བར་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་ན།
en: “If the buddhafield is pure only to the extent that the mind of the bodhisattva is pure,

source: བདག་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དེ་ནི་གཉིས་ཏེ།
en: “ ‘Self’ and ‘selflessness’ are dualistic.

source: གང་བདག་གི་དངོས་པོ་མི་དམིགས་པ་དེ་ཅི་ཞིག་བདག་མེད་པར་བྱེད་པར་འགྱུར་བ་དེ་དག་གི་ངོ་བོ་ཉིད་མཐོང་བས་གཉིས་སུ་མེད་པ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: Since the existence of self cannot be perceived, what is there to be made ‘selfless’? Thus, the nondual vision of their nature is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ནས་སྦས་ཀྱིས་སྨྲས་པ།
en: The bodhisattva Samantagupta declared,

source: །དེ་ལྟ་བུར་རབ་ཏུ་ཞུགས་པ་དེ་ནི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོར་ཞུགས་པ་ཞེས་བྱའོ།
en: The experience of such is called ‘the entrance into the principle of nonduality.’ ”

source: སྐད་ཅིག་པ་ལ་ཟད་པ་མེད་དོ།
en: and what is instantaneous is indestructible.

source: །གང་མི་ཟད་པ་དེ་ནི་སྐད་ཅིག་པ་སྟེ།
en: What is indestructible is instantaneous,

source: གང་ཤིན་ཏུ་ཟད་པ་དེ་ལ་ཟད་པར་བྱ་བ་མ་ཡིན་པས་ན་དེའི་ཕྱིར་མི་ཟད་པ་ཞེས་བྱའོ།
en: What is ultimately destroyed does not become destroyed; hence, it is called ‘indestructible.’

source: མ་རིག་པའི་རང་བཞིན་ལྟར་རིག་པའང་དེ་བཞིན་ཏེ།
en: The natures of ignorance and knowledge are the same,

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན།
en: then, when Śākyamuni Buddha was engaged in the career of the bodhisattva,

source: དེ་སེམས་ཡོངས་སུ་མ་དག་གམ།
en: his mind must have been impure.

source: ཅི་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལྟ་བུར་ཡོངས་སུ་མ་དག་པར་སྣང་སྙམ་མོ།
en: Otherwise, how could this buddhafield appear to be so impure?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Buddha, aware of venerable Śāriputra’s thoughts, said to him,

source: །ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, Śāriputra?

source: ཉི་མ་དང་ཟླ་བ་ཡོངས་སུ་མ་དག་གམ་ཅི་ན་དམུས་ལོང་དག་གིས་མི་མཐོང་། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ།
en: Is it because the sun and moon are impure that those blind from birth do not see them?” Śāriputra replied, “No, Lord. It is not so.

source: །དེ་ནི་དམུས་ལོང་གིས་ནོངས་ཀྱི་ཉི་མ་དང་ཟླ་བས་ནི་མ་ནོངས་སོ།
en: The fault lies with those blind from birth, and not with the sun and moon.”

source: མ་རིག་པ་གང་ཡིན་པ་དེ་ནི་ལུང་དུ་མ་བསྟན་པ། བགྲང་དུ་མེད་པ་བགྲང་བའི་ལམ་ལས་འདས་པའོ།
en: for ignorance is undefined, incalculable, and beyond the sphere of thought.

source: །གང་འདི་ལ་མངོན་པར་རྟོགས་པ་དེ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: The realization of this is the entrance into nonduality.”

source: །བྱང་ཆུབ་སེམས་དཔའ་མཐོང་དགས་སྨྲས་པ།
en: The bodhisattva Priyadarśana declared,

source: གཟུགས་ཉིད་སྟོང་པ་སྟེ།
en: “Matter itself is void.

source: །བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་
en: The Buddha declared, “In the same way, Śāriputra,

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་དྲུག་པའོ།
en: That is the sixth strange and wonderful thing.

source: སེམས་ཅན་ལ་ལས་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་མི་མཐོང་བ་
en: the fact that some living beings do not behold the splendid display of virtues of the buddhafield of the Tathāgata

source: དེ་ནི་སེམས་ཅན་རྣམས་ཀྱིས་མི་ཤེས་པས་ཉེས་ཀྱི་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཉེས་པ་ནི་མ་ཡིན་ནོ།
en: is due to their own ignorance. It is not the fault of the Tathāgata.

source: །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་ཡོངས་སུ་དག་མོད་ཀྱི་ཁྱོད་ཀྱིས་དེ་མི་མཐོང་ངོ་།
en: Śāriputra, the buddhafield of the Tathāgata is pure, but you do not see it.”

source: །དེ་ནས་ཚངས་པ་རལ་པ་ཅན་གྱིས་གནས་བརྟན་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the Brahmā Śikhin said to the venerable Śāriputra,

source: །བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་གོ་ཞེས་མ་ཟེར་ཅིག
en: “Reverend Śāriputra, do not say that the buddhafield of the Tathāgata is impure.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་འདི་ལྟ་སྟེ་
en: Reverend Śāriputra, the buddhafield of the Tathāgata is pure.

source: དཔེར་ན་བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་གནས་ཀྱི་བཀོད་པ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པའང་ཁོ་བོས་དེ་འདྲ་བ་མཐོང་ངོ་།
en: I see the splendid expanse of the buddhafield of the Lord Śākyamuni as equal to the splendor of, for example, the abodes of the highest deities.”

source: །དེ་ནས་གནས་བརྟན་ཤཱ་རིའི་བུས་ཚངས་པ་རལ་པ་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the venerable Śāriputra said to the Brahmā Śikhin,

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་བདུན་པའོ།
en: That is the seventh strange and wonderful thing.

source: ། ཚངས་པ་ཁོ་བོས་ནི་ས་ཆེན་པོ་འདི་མཐོན་དམན་དང་། ཚེར་མ་དང་། གཡང་ས་དང་། རིའི་རྩེ་མོ་དང་། ངམ་གྲོག་དང་། འཇིམ་ངན་གྱིས་རབ་ཏུ་གང་བར་མཐོང་ངོ་།
en: “As for me, O Brahmā, I see this great earth, with its highs and lows, its thorns, its precipices, its peaks, and its abysses, as if it were entirely filled with ordure.”

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་ཁྱིམ་འདི་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དང་། སྣང་བ་མཐའ་ཡས་དང་། མི་འཁྲུགས་པ་དང་། དཀོན་མཆོག་དཔལ་དང་། དཀོན་མཆོག་འོད་འཕྲོ་དང་། དཀོན་མཆོག་ཟླ་བ་དང་། དཀོན་མཆོག་བཀོད་པ་དང་། བཟོད་དཀའ་དང་། དོན་ཐམས་ཅད་གྲུབ་པ་དང་། རིན་ཆེན་མང་དང་། སེང་གེ་བསྒྲགས་པ་དང་། སེང་གེའི་སྒྲ་དེ་བཞིན་གཤེགས་པ་ལ་སོགས་པ་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་རྣམས་སྐྱེས་བུ་དམ་པ་འདིས་བསམས་མ་ཐག་ཏུ་ཀུན་གཤེགས་ཏེ།
en: Furthermore, reverend Śāriputra, at the wish of this good man, to this house come the innumerable tathāgatas of the ten directions, such as the Tathāgatas Śākyamuni, Amitābha, Akṣobhya, Ratnaśrī‌, Ratnārcis, Ratnacandra, Ratnavyūha, Duḥprasāha, Sarvārtha­siddha, Prabhūtaratna, Siṃhanādanādī, Siṃhaghoṣa, and so forth,

source: །ཚངས་པ་རལ་པ་ཅན་གྱིས་སྨྲས་པ།
en: Brahmā Śikhin replied,

source: གཤེགས་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པ་བསྟན་ནས་སླར་གཤེགས་ཏེ།
en: and when they come they teach the door of Dharma called The Secrets of the Tathāgatas, and then depart.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་ཁྱིམ་འདི་ན་ལྷ་ཐམས་ཅད་ཀྱི་གནས་ཀྱི་བཀོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཐམས་ཅད་སྣང་སྟེ།
en: Furthermore, reverend Śāriputra, all the splendors of the abodes of the gods and all the splendors of the fields of the buddhas shine forth in this house.

source: དེ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་བརྒྱད་པའོ།
en: That is the eighth strange and wonderful thing.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱིམ་འདི་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་བརྒྱད་པོ་དེ་དག་སྣང་སྟེ།
en: Reverend Śāriputra, these eight strange and wonderful things are seen in this house.

source: འདི་ལྟ་བུ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་མཐོང་ན་ཉན་ཐོས་ཀྱི་ཆོས་ལ་སུ་ཞིག་འདོད་པར་འགྱུར།
en: Who then, seeing such inconceivable things, would believe the teaching of the disciples?

source: །དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་གཉིས་སོ།
en: Likewise, it is dualistic to dedicate morality, tolerance, effort, meditation, and wisdom for the sake of omniscience.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་སྒྱུ་མ་མཁན་གྱིས་བུད་མེད་སྤྲུལ་པ་དེ་ལ་འདི་ལྟར་ཁྱོད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་བསྒྱུར་ན་ཅི་ཉེས་ཞེས་བྱས་ན་དེ་ཇི་སྐད་ཟེར་བར་འགྱུར།
en: Reverend Śāriputra, if a magician were to incarnate a woman by magic, would you ask her, “What prevents you from transforming yourself out of your female state?”

source: །ཐམས་ཅད་མཁྱེན་པའི་ངོ་བོ་ཉིད་ནི་ཡོངས་སུ་བསྔོ་བའོ།
en: and the nature of omniscience itself is total dedication.

source: སྦྱིན་པའི་ངོ་བོ་ཉིད་ནི་ཐམས་ཅད་མཁྱེན་པའོ།
en: The nature of generosity is itself omniscience,

source: སྒྱུ་མས་སྤྲུལ་པའི་ངོ་བོ་ཉིད་ལ་བུད་མེད་ཀྱི་དངོས་པོ་ལས་བསྒྱུར་ན་ཅི་ཉེས་ཞེས་ཁྱོད་དེ་སྙམ་དུ་སེམས།
en: Now, would you think, “What prevents one whose nature is that of a magical incarnation from transforming herself out of her female state?”

source: སྦྱིན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་གཉིས་ཏེ།
en: “The dedication of generosity for the sake of attaining omniscience is dualistic.

source: །བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་མི་ཟད་པས་སྨྲས་པ།
en: The bodhisattva Akṣayamati declared,

source: །དེ་ལྟར་ཞི་བ་ལ་གནས་པ་ནི་གཉིས་སུ་མེད་པར་འཇུག་པའོ།
en: To live in such peace is to enter into nonduality.”

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་འདྲ་བར་ཡོངས་སུ་མ་དག་པར་མཐོང་བ་ནི་
en: “The fact that you see such a buddhafield as this as if it were so impure,

source: །ཤཱ་རིའི་བུ་ལྷ་མོའི་གཟུགས་སུ་གྱུར་པས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: And Śāriputra, transformed into the goddess, replied,

source: །ཁོ་བོ་སྐྱེས་པའི་གཟུགས་ནི་མི་སྣང་བར་གྱུར་ཏེ།
en: “I no longer appear in the form of a male!

source: བཙུན་པ་ཤཱ་རིའི་བུ་སེམས་ལ་མཐོན་དམན་ཡོད་ཅིང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་བསམ་པ་ཡོངས་སུ་མ་དག་པར་ངེས་སོ།
en: reverend Śāriputra, is a sure sign that there are highs and lows in your mind and that your positive thought in regard to the buddha-gnosis is not pure either.

source: །དེ་བཞིན་དུ་རྣ་བ་དང་སྒྲ། སྣ་དང་དྲི། ལྕེ་དང་རོ། ལུས་དང་རེག །ཡིད་དང་ཆོས་དེ་དག་ནི་གཉིས་སོ།
en: Similarly, ‘ear’ and ‘sound,’ ‘nose’ and ‘smell,’ ‘tongue’ and ‘taste,’ ‘body’ and ‘touch,’ and ‘mind’ and ‘phenomena’—all are dualistic.

source: ཁོ་བོ་བུད་མེད་ཀྱི་ལུས་སུ་གྱུར་ནས་གང་བསྒྱུར་མི་ཤེས་སོ།
en: My body has changed into the body of a woman! I do not know what to transform!”

source: །གང་དག་བཙུན་པ་ཤཱ་རིའི་བུ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་ཞིང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་བསམ་པ་ཡོངས་སུ་དག་པ་དེ་དག་གིས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡོངས་སུ་དག་པར་མཐོང་ངོ་།
en: Reverend Śāriputra, those whose minds are impartial toward all living beings and whose positive thoughts toward the buddha-gnosis are pure see this buddhafield as perfectly pure.”

source: །ཇི་ལྟར་གནས་བརྟན་བུད་མེད་དུ་སྣང་བ་དེ་བཞིན་དུ་བུད་མེད་ཐམས་ཅད་ཀྱང་བུད་མེད་ཀྱི་གཟུགས་སུ་སྣང་སྟེ།
en: All women appear in the form of women in just the same way as the elder appears in the form of a woman.

source: བུད་མེད་མ་ཡིན་པ་ལས་བུད་མེད་ཀྱི་གཟུགས་སུ་སྣང་ངོ་།
en: While they are not women in reality, they appear in the form of women.
